var data=[];

var dataStr="1、奎尔公园<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp奎尔公园位于西班牙巴塞罗那市区市北，占地20公顷，原来是巴塞罗那富商艾乌塞比奎尔伯爵计划建立并由高迪设计的一个社区旧址，建于1900-1914年，并被联合国教科文组织列入世界文化遗产。1922年，市政府将其收购，开辟为社区公园对外开放。<br>\
<br>\
<br>\
2、赫尔辛基圣约翰教堂<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp芬兰赫尔辛基圣约翰教堂，是芬兰首都赫尔辛基的一座路德会教堂，由瑞典建筑师设计，哥特复兴风格。按照容量，它是芬兰最大的石砌教堂。圣约翰教堂位于赫尔辛基的Ullanlinna区，兴建于 1888 -1893年，是赫尔辛基的第三座路德会教堂，也是最大的一座。双塔高74米，有2,600个座位，音响效果极佳，因此会在此举办大型音乐会。<br>\
<br>\
<br>\
3、巴约之家<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp“巴约之家”西班牙语名为Casa Batlló，casa是房子之意，这是高迪于1904-1906年间为当时赫赫有名的纺织商人Josep Batlló（乔什·巴约）设计建造的一幢六层高的住宅楼，随着岁月变迁，现在巴约之家早已被改为向公众开放的建筑艺术博物馆，高迪的建筑才华在此展现得淋漓尽致。<br>\
<br>\
<br>\
4、冬宫<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp俄罗斯冬宫，音译为埃尔米塔日建于1754~1762年，坐落在圣彼得堡冬宫广场上，是圣彼得堡最著名的古建筑之一，是十八世纪中叶巴洛克建筑风格的杰出典范。冬宫原为叶卡捷琳娜二世的皇宫，现为艾尔米塔什博物馆的一部分。<br>\
<br>\
<br>\
5、圣索菲亚大教堂<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp圣索菲亚大教堂是古都伊斯坦布尔最大的教堂，是古代拜占庭的艺术杰作。教堂从不同角度看都有不同效果，它既有罗马建筑的特色，又有东方艺术的韵味。土黄色的大理石地面，各国的游客聚集其中。拍照时一束束光透过小窗照进大厅，顿时荡涤心灵。<br>\
<br>\
<br>\
6、圣保罗教堂<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp圣保罗大教堂(St.Paul's Cathedral)是世界著名的宗教圣地，世界第五大教堂，英国第一大教堂，教堂也是世界第二大圆顶教堂，位列世界五大教堂之列。教堂坐落在离奥莱里亚耐城墙两公里远的空旷区域，初建时它的周围是一片广阔的田野，为此被人们称作“城外的圣保罗”。<br>\
<br>\
<br>\
7、巴塞罗那圣心教堂<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp巴塞罗那最具特色的景点当然是高迪建造的圣家族教堂和米拉之家、巴特罗之家，但假如巴塞罗那没有高迪，位于迪比达波山上的圣心教堂绝对是巴塞罗那数一数二的旅游目的地。<br>\
<br>\
<br>\
8、英国伊利大教堂<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp英国伊利镇伊利大教堂，英国大型哥特式教堂之一，始建于12世纪。整个小镇是依托教堂建立的，大部分镇上居民是为伊利大教堂工作。鲜有游客专门来此参观教堂，不过如果要去剑桥的话，顺路来一趟也是个不错的选择，整点时还有团队登顶的活动，在教堂顶端可以看到剑桥。<br>\
<br>\
<br>\
9、芬兰<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp“千岛之国”与“千湖之国”，浪漫的街道、温馨的建筑、可爱的圣诞老人和绝美的冰雪都汇聚在这片北欧的陆地上。 走进芬兰，你会惊奇地发现仿佛置身于另一个世界，一切都是那么的不同，一切都超乎了你的想象。<br>\
<br>\
<br>\
10、斯德哥尔摩<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp瑞典斯德哥尔摩，瑞典首都，也是第一大城市。瑞典国家政府、国会以及皇室的官方宫殿都设在斯德哥尔摩。它位于瑞典的东海岸，濒波罗的海，梅拉伦湖入海处，风景秀丽，是著名的旅游胜地。市区分布在14座岛屿和一个半岛上，70余座桥梁将这些岛屿联为一体，因此享有“北方威尼斯”的美誉。<br>\
<br>\
<br>\
11、水城威尼斯<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp水城威尼斯是文艺复兴的精华，世界上唯一没有汽车的城市，上帝将眼泪流在了这里，却让它更加晶莹和柔情，就好像一个漂浮在碧波上浪漫的梦。<br>\
<br>\
<br>\
12、斯塔万格木板教堂<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp斯塔万格木板教堂或是叫乌尔内斯木板教堂，坐落在挪威西海岸，是一座融合了凯尔特、维京和罗马等多种建筑风格的中世纪教堂。令人惊异的是，这座教堂并非是传统的石质，而是木质的，而且是挪威28座木质教堂中最古老的一座，建于12世纪，至今已存在了900多年。<br>\
<br>\
<br>\
13、芬兰纳坦利姆明之家<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp芬兰纳坦利姆明之家。纳坦利是1443年从图尔库郊外的一所修道院发展而来的港镇。它虽然地处边角、远离喧嚣，但是到处都满载着精彩，周围弥漫着幽雅的闲情逸致。特别是有一座大型的童话主题公园姆明世界（Moomin World）就坐落在Kailo小岛上。<br>\
<br>\
<br>\
14、希腊圣托里尼岛伊亚<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp希腊圣托里尼岛伊亚小镇。爱琴海最迷人的地方非圣托里尼岛莫属，它总是这样出现在诗句中：美丽的圣托里尼，有世界上最美的落日，最壮阔的海景；天地间蓝与白的相知相间，蓝得彻底，白得耀眼。当黄昏，游人便会纷至沓来，人满为患。因为在这里，才能欣赏到圣托里尼岛最著名的“日落爱琴海”的美景。<br>\
<br>\
<br>\
15、德国韦尼格罗德城堡<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp德国萨克森 –安哈尔特州韦尼格罗德城堡。韦尼格罗德是德国中部城市，在哈茨山北麓、霍尔特默河（Holtemme）和齐利尔巴赫河（Zilierbach）汇流处。是闻名遐迩的哈茨地区古镇，当地的民居以色彩鲜艳的木屋结构为特点。韦尼格罗德城堡，德国最受欢迎的博物馆之一.<br>\
<br>\
<br>\
16、捷克圣维特教堂<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp圣维特教堂和大小宫殿组成了捷克皇家城堡，建于公元7世纪，最初为波希米亚的皇室宫邸，远远望去，乳黄色的楼房，铁灰色的教堂，淡绿色的钟楼，白色的尖顶。布拉格城堡是历届总统的办公室 ，故又称总统府。这里有罗马式 、哥特式、巴洛克式、文艺复兴式等各个历史时代风格的建筑。<br>\
<br>\
<br>\
17、斯洛伐克城堡<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp斯洛伐克--波切尼斯城堡】是斯洛伐克最古老而著名的城堡之一。最初是木质结构的，直到十三世纪时才由当时的贵族波兹南家族重建成石质建筑。城堡及其周围的领地抑制一直掌握在国王们的手中，国王将他做为奖赏将给那些重要的贵族和他们的家族。<br>\
<br>\
<br>\
18、北京天坛<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp天坛是北京“天地日月”诸坛之首，是中国和世界上现存最大的古代祭祀性建筑群，始建于明永乐十八年，是一座典型坛庙，是明清两代皇帝祭天祈谷的场所。每年孟春祈谷、孟夏祈雨、孟冬祀天。无论从架构、力学还是美学角度来看，天坛都是出类拔萃、举世无双的建筑杰作。<br>\
<br>\
<br>\
19、伊斯坦布尔<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp伊斯坦布尔之所以闻名于世，主要原因之一是其得天独厚的地理位置。在亚洲大陆最西端的黑海与地中海之间，有一条至关重要的“黄金水道”，它把亚洲和欧洲大陆分割开来，其中间部分是马尔马拉海峡，南端叫达达尼尔海峡，北端叫博斯普鲁斯（伊斯坦布尔）海峡，总称黑海海峡。<br>\
<br>\
<br>\
20、圣彼得堡<br>\
<br>\
\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp\&nbsp圣彼得堡已有300多年的历史，位于俄罗斯西北部，波罗的海沿岸，它是俄罗斯最大的海港，是全国重要饿水陆空交通枢纽。整个城市具有鲜明的俄罗斯风情。圣彼得堡也是俄罗斯仅次于莫斯科的第二大工业中心和重要的海港和造船基地。<br>\
";


var d = dataStr.split('<br><br><br>')
for (var i = 0; i < d.length; i++) {
  var c = d[i].split('<br><br>');
  data.push({   //传入对象

    img: c[0].replace('、',' ')+'.jpg',
    caption:c[0].split('、')[1],
    description:c[1]
  });
  console.log(c[0].replace('、',' ')+'.jpg');
}
